bounce_height = 100
bounce_ratio = 3 / 5

for i in range(1, 11):
    bounce_height *= bounce_ratio
    # print(bounce_height)

    # round(number,ndigits) nidigits小数位数
    # >>> 36.0000
    # 36.0
    # >>> round(1.0077695999999998,4)
    # 1.0078
    print(f"{i}) {bounce_height} -> {round(bounce_height,4)}")

"""output
1) 60.0 -> 60.0
2) 36.0 -> 36.0
3) 21.599999999999998 -> 21.6
4) 12.959999999999999 -> 12.96
5) 7.775999999999999 -> 7.776
6) 4.6655999999999995 -> 4.6656
7) 2.7993599999999996 -> 2.7994
8) 1.6796159999999998 -> 1.6796
9) 1.0077695999999998 -> 1.0078
10) 0.6046617599999998 -> 0.6047
"""
